{
  "class_name": "Sequential",
  "config": {
    "name": "sequential_1",
    "layers": [
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_1",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            4
          ],
          "dtype": "float32",
          "filters": 32,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_1",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Conv2D",
        "config": {
          "name": "conv2d_2",
          "trainable": true,
          "batch_input_shape": [
            null,
            16,
            16,
            4
          ],
          "dtype": "float32",
          "filters": 64,
          "kernel_size": [
            5,
            5
          ],
          "strides": [
            1,
            1
          ],
          "padding": "same",
          "data_format": "channels_last",
          "dilation_rate": [
            1,
            1
          ],
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "MaxPooling2D",
        "config": {
          "name": "max_pooling2d_2",
          "trainable": true,
          "dtype": "float32",
          "pool_size": [
            2,
            2
          ],
          "padding": "valid",
          "strides": [
            2,
            2
          ],
          "data_format": "channels_last"
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_1",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "relu",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Reshape",
        "config": {
          "name": "reshape_1",
          "trainable": true,
          "dtype": "float32",
          "target_shape": [
            1024
          ]
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_2",
          "trainable": true,
          "dtype": "float32",
          "units": 16384,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_1",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_3",
          "trainable": true,
          "dtype": "float32",
          "units": 1024,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_2",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_4",
          "trainable": true,
          "dtype": "float32",
          "units": 64,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      },
      {
        "class_name": "Dropout",
        "config": {
          "name": "dropout_3",
          "trainable": true,
          "dtype": "float32",
          "rate": 0.5,
          "noise_shape": null,
          "seed": null
        }
      },
      {
        "class_name": "Dense",
        "config": {
          "name": "dense_5",
          "trainable": true,
          "dtype": "float32",
          "units": 1,
          "activation": "linear",
          "use_bias": true,
          "kernel_initializer": {
            "class_name": "VarianceScaling",
            "config": {
              "scale": 1.0,
              "mode": "fan_avg",
              "distribution": "uniform",
              "seed": null
            }
          },
          "bias_initializer": {
            "class_name": "Zeros",
            "config": {}
          },
          "kernel_regularizer": null,
          "bias_regularizer": null,
          "activity_regularizer": null,
          "kernel_constraint": null,
          "bias_constraint": null
        }
      }
    ]
  },
  "keras_version": "2.3.0",
  "backend": "tensorflow"
}